
from telegram import Update
from telegram.ext import ContextTypes
from telegram.ext import ConversationHandler
from keyboards.main_menu import summaries_admin_menu, subjects_summary_menu, lectures_summary_menu
from database.queries import get_summaries, add_summary


async def button_handler(update: Update, context: ContextTypes.DEFAULT_TYPE):

    text = update.message.text


    if text == "📚 المواد الدراسية":

        await update.message.reply_text(
                "━━━━━━━━━━━━━━━━━━\n"
    "📚 المواد الدراسية\n"
    "🎓 المستوى الثاني\n"
                "━━━━━━━━━━━━━━━━━━\n\n"

    "اختر المادة التي تريد معرفة تفاصيلها 👇\n\n"

    "🗄️ أساسيات قواعد البيانات\n"
    "💻 معمارية وتنظيم الحاسوب\n"
    "☕ البرمجة الكائنية التوجه (Java)\n"
    "🌐 شبكات الحاسوب\n"
    "🎨 تصميم الويب 1\n"
    "🗣️ مهارات الاتصال\n"
    "🇾🇪 ثقافة وطنية\n\n"

    "━━━━━━━━━━━━━━━━━━\n"
    "🚀 UniX2"
)



    elif text == "📁 الملخصات":

        await update.message.reply_text(
              "━━━━━━━━━━━━━━━━━━\n"
        "📁 الملخصات\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "اختر المادة التي تريد ملخصاتها 👇\n\n"

        "🗄️ أساسيات قواعد البيانات\n"
        "💻 معمارية وتنظيم الحاسوب\n"
        "☕ البرمجة الكائنية التوجه (Java)\n"
        "🌐 شبكات الحاسوب\n"
        "🎨 تصميم الويب 1\n"
        "🗣️ مهارات الاتصال\n"
        "🇾🇪 ثقافة وطنية\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🔙 العودة"
    )                                      


    elif text == "📝 التكاليف":

        await update.message.reply_text(
              "━━━━━━━━━━━━━━━━━━\n"
        "📝 التكاليف والواجبات\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "للحصول على آخر التكاليف المطلوبة\n"
        "والتحديثات الخاصة بالمواد 👇\n\n"

        "💰 مسؤول التكاليف:\n"
        "⭐ عبدالله البرعي\n"
        "📞 +967730185760\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🔙 العودة"
    )


    elif text == "📄 الامتحانات السابقة":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "📄 الامتحانات السابقة\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "اختر المادة التي تريد امتحاناتها 👇\n\n"

        "🗄️ أساسيات قواعد البيانات\n"
        "💻 معمارية وتنظيم الحاسوب\n"
        "☕ البرمجة الكائنية التوجه (Java)\n"
        "🌐 شبكات الحاسوب\n"
        "🎨 تصميم الويب 1\n"
        "🗣️ مهارات الاتصال\n"
        "🇾🇪 ثقافة وطنية\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🔙 العودة"
    )
        
    elif text == "⏰ الدوام":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "⏰ حالة الدوام اليوم\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "❌ لا يوجد دوام اليوم\n\n"

        "📌 لا توجد محاضرات مسجلة حالياً.\n\n"

        "🔔 سيتم تحديث حالة الدوام\n"
        "عند إضافة أي محاضرة جديدة.\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "💡 نظامك الجامعي الذكي"
    )
        
    elif text == "📍 أماكن القاعات":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "📍 أماكن القاعات\n"
        "🏛️ كلية علوم وهندسة الحاسوب\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "🏛️ مبنى القديم\n\n"
        "⬆️ الدور الثاني\n"
        "🎓 المدرج 6\n\n"

        "━━━━━━━━━━━━━━━━━━\n\n"

        "🏢 مبنى الآداب\n\n"
        "📌 معافا الأهدل\n"
        "🎓 المدرجات الاثنين\n"
        "🎓 العلفي\n"
        "💻 معمل يمن موبايل\n"
        "💻 معمل الهندسة\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "📚 دليلك الجامعي الذكي"
    )
        
    elif text == "📢 الإعلانات":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "📢 الإعلانات الجامعية\n"
        "🎓 قسم تقنية المعلومات\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "🔔 آخر الأخبار والتحديثات:\n\n"

        "📌 لا توجد إعلانات جديدة حالياً.\n\n"

        "سيتم نشر:\n"
        "✅ مواعيد الاختبارات\n"
        "✅ تغييرات الدوام\n"
        "✅ التنبيهات المهمة\n"
        "✅ أخبار القسم\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "📚 ابقَ على اطلاع دائم"
    )



    elif text == "🧠 UniX2 AI":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "🧠 UniX2 AI\n"
        "🤖 المساعد الذكي\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "✨ أهلاً بك في عالم الذكاء الاصطناعي ✨\n\n"

        "أنا مساعدك الذكي المصمم لمساعدتك في:\n\n"
        "📚 شرح الدروس\n"
        "💻 مساعدة البرمجة\n"
        "🧠 تبسيط المفاهيم\n"
        "📝 حل الأسئلة\n"
        "🌍 الإجابة عن الأسئلة العامة خارج نظام الجامعة\n\n"

        "━━━━━━━━━━━━━━━━━━\n"

        "👨‍💻 مهندس النظام:\n"
        "⭐ عمر الشميري\n\n"

        "━━━━━━━━━━━━━━━━━━\n"

        "🚀 اضغط على زر بدء المحادثة\n"
        "للدخول إلى UniX2 AI"
    )
        

    elif text == "👤 المندوب":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "👤 مندوب الدفعة\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "يسعدنا تعريفكم بمندوب الدفعة:\n\n"

        "⭐ الاسم:\n"
        "عبدالرزاق النجار\n\n"

        "💬 حساب التواصل:\n"
        '<a href="https://t.me/axyom_rzq">@axyom_rzq</a>\n\n'

        "📌 اضغط على الحساب للتواصل مباشرة.\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "📚 نظامك الجامعي الذكي",

        parse_mode="HTML"
    )
        
    elif text == "💰 مسؤول التكاليف":

        await update.message.reply_text(
            "━━━━━━━━━━━━━━━━━━\n"
            "💰 مسؤول التكاليف\n"
            "🎓 المستوى الثاني\n"
            "━━━━━━━━━━━━━━━━━━\n\n"

            "للاستفسار عن آخر التكاليف\n"
            "والواجبات المطلوبة:\n\n"

            "⭐ الاسم:\n"
            "عبدالله البرعي\n\n"

            "📱 رقم التواصل:\n"
            "+967730185760\n\n"

            "━━━━━━━━━━━━━━━━━━\n"
            "🚀 UniX2\n"
            "📚 نظامك الجامعي الذكي"
    )




    elif text == "👨‍💻 مهندس النظام":

           await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━━━\n"
        "👨‍💻 مهندس النظام\n"
        "🚀 UniX2 Developer\n"
        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "✨ مطور وصانع نظام UniX2 الذكي ✨\n\n"

        "تم تصميم وتطوير هذا النظام\n"
        "لخدمة طلاب كلية علوم وهندسة الحاسوب\n"
        "وقسم تقنية المعلومات.\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "⭐ الاسم:\n"
        "عمر الشميري\n\n"

        "💻 التخصص:\n"
        "تقنية معلومات | IT\n\n"

        "🧠 مجالات التطوير:\n"
        "🐍 Python\n"
        "🤖 الذكاء الاصطناعي\n"
        "⚙️ تطوير الأنظمة والبوتات\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "💬 للتواصل مع مهندس النظام:\n"
        '<a href="https://t.me/alshmyrymr248">@alshmyrymr248</a>\n\n'

        "━━━━━━━━━━━━━━━━━━━━\n"

        "🚀 UniX2\n"
        "💡 فكرة... تطوير... مستقبل",

        parse_mode="HTML"
    )
           
    elif text == "ℹ️ عن النظام":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━━━\n"
        "ℹ️ عن نظام UniX2\n"
        "🎓 Smart University Assistant\n"
        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "🚀 UniX2 هو نظام جامعي ذكي\n"
        "تم تطويره لخدمة طلاب كلية علوم وهندسة الحاسوب\n"
        "وقسم تقنية المعلومات.\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "🎯 أهداف النظام:\n"
        "✅ تسهيل الوصول إلى الخدمات الجامعية\n"
        "✅ تنظيم المواد والملخصات\n"
        "✅ متابعة التكاليف والواجبات\n"
        "✅ معرفة الدوام والقاعات\n"
        "✅ توفير المساعدة الذكية عبر UniX2 AI\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "⚙️ خدمات UniX2:\n"
        "📚 المواد الدراسية\n"
        "📁 الملخصات\n"
        "📝 التكاليف\n"
        "📄 الامتحانات السابقة\n"
        "⏰ حالة الدوام\n"
        "📢 الإعلانات الجامعية\n"
        "🤖 الذكاء الاصطناعي\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "👨‍💻 مهندس النظام:\n"
        "⭐ عمر الشميري\n\n"

        "🚀 الإصدار:\n"
        "Version 2.0\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n"
        "💡 UniX2\n"
        "نظامك الجامعي الذكي"
    )


    elif text == "🔐 لوحة الإدارة":

        from handlers.admin import admin_panel

        await admin_panel(update, context)


    elif text == "📚 إدارة الملخصات":

        await update.message.reply_text(
            """
━━━━━━━━━━━━━━━━━━━━
📚 إدارة الملخصات
━━━━━━━━━━━━━━━━━━━━

اختر العملية التي تريد تنفيذها:



━━━━━━━━━━━━━━━━━━━━
🚀 UniX2
💡 نظامك الجامعي الذكي
""",
            reply_markup=summaries_admin_menu()
        )


    elif text == "➕ إضافة ملخص":

        context.user_data["adding_summary"] = True

        await update.message.reply_text(
            """
━━━━━━━━━━━━━━━━━━━━
➕ إضافة ملخص جديد
━━━━━━━━━━━━━━━━━━━━

📚 اختر المادة التي تريد إضافة ملخص لها:

━━━━━━━━━━━━━━━━━━━━
🚀 UniX2
💡 نظامك الجامعي الذكي
""",
            reply_markup=subjects_summary_menu()
        )


    elif text in [
        "🗄️ أساسيات قواعد البيانات",
        "💻 معمارية وتنظيم الحاسوب",
        "☕ البرمجة الكائنية التوجه (Java)",
        "🌐 شبكات الحاسوب",
        "🎨 تصميم الويب 1",
        "🗣️ مهارات الاتصال",
        "🇾🇪 ثقافة وطنية",
    ]:

        if context.user_data.get("adding_summary"):

            context.user_data["subject"] = text

            await update.message.reply_text(
                f"""
━━━━━━━━━━━━━━━━━━━━
📖 اختيار المحاضرة
━━━━━━━━━━━━━━━━━━━━

📚 المادة:
{text}

اختر المحاضرة التي تريد إضافة ملخص لها 👇

━━━━━━━━━━━━━━━━━━━━
🚀 UniX2
💡 نظامك الجامعي الذكي
""",
                reply_markup=lectures_summary_menu()
            )

            return

        summaries = get_summaries(text)

        if summaries:

            message = (
                "━━━━━━━━━━━━━━━━━━━━\n"
                "📚 ملخصات المادة\n"
                "━━━━━━━━━━━━━━━━━━━━\n\n"
                f"📖 المادة: {text}\n\n"
                "📂 الملخصات المتوفرة:\n\n"
            )

            for lecture, file_id in summaries:
                message += f"📄 {lecture}\n"

            message += (
                "\n━━━━━━━━━━━━━━━━━━━━\n"
                "🚀 UniX2\n"
                "💡 نظامك الجامعي الذكي"
            )

        else:

            message = (
                "━━━━━━━━━━━━━━━━━━━━\n"
                "📚 ملخصات المادة\n"
                "━━━━━━━━━━━━━━━━━━━━\n\n"
                f"📖 المادة: {text}\n\n"
                "⚠️ لا توجد ملخصات مضافة لهذه المادة حالياً.\n\n"
                "🔔 سيتم إضافة الملخصات قريباً.\n\n"
                "━━━━━━━━━━━━━━━━━━━━\n"
                "🚀 UniX2\n"
                "💡 نظامك الجامعي الذكي"
            )

        await update.message.reply_text(message)


    elif text in [
        "1️⃣ المحاضرة الأولى",
        "2️⃣ المحاضرة الثانية",
        "3️⃣ المحاضرة الثالثة",
        "4️⃣ المحاضرة الرابعة",
        "5️⃣ المحاضرة الخامسة",
        "6️⃣ المحاضرة السادسة",
        "7️⃣ المحاضرة السابعة",
        "🔙 العودة للمواد",
    ]:


        if text == "🔙 العودة للمواد":

            await update.message.reply_text(
                """
━━━━━━━━━━━━━━━━━━━━
➕ إضافة ملخص جديد
━━━━━━━━━━━━━━━━━━━━

📚 اختر المادة التي تريد إضافة ملخص لها:

━━━━━━━━━━━━━━━━━━━━
🚀 UniX2
💡 نظامك الجامعي الذكي
""",
                reply_markup=subjects_summary_menu()
            )

            return


        if context.user_data.get("adding_summary"):

            context.user_data["lecture"] = text


            await update.message.reply_text(
                """
━━━━━━━━━━━━━━━━━━━━
📎 رفع الملخص
━━━━━━━━━━━━━━━━━━━━

أرسل ملف الملخص الآن:

✅ PDF
✅ DOC
✅ DOCX

━━━━━━━━━━━━━━━━━━━━
🚀 UniX2
💡 نظامك الجامعي الذكي
"""
            )

            return


    elif text == "🔙 العودة للقائمة الرئيسية":

        from keyboards.main_menu import main_menu

        await update.message.reply_text(
            "🏠 تم الرجوع إلى القائمة الرئيسية.",
            reply_markup=main_menu()
        )


    elif text == "🔙 العودة للوحة الإدارة":

        from keyboards.main_menu import admin_menu

        await update.message.reply_text(
            "🔐 تم الرجوع إلى لوحة الإدارة.",
            reply_markup=admin_menu()
        )


    elif text == "🔙 العودة":

        await update.message.reply_text(
            "🔐 تم الرجوع إلى إدارة الملخصات.",
            reply_markup=summaries_admin_menu()
        )



    else:

        await update.message.reply_text(
            "⚡ اختر أحد الخيارات من القائمة الرئيسية."
        )
        
