
from telegram import Update
from telegram.ext import ContextTypes


async def button_handler(update: Update, context: ContextTypes.DEFAULT_TYPE):

    text = update.message.text


    if text == "📚 المواد الدراسية":

        await update.message.reply_text(
                "━━━━━━━━━━━━━━━━━━\n"
    "📚 المواد الدراسية\n"
    "🎓 المستوى الثاني\n"
                "━━━━━━━━━━━━━━━━━━\n\n"

    "اختر المادة التي تريد معرفة تفاصيلها 👇\n\n"

    "🗄️ أساسيات قواعد البيانات\n"
    "💻 معمارية وتنظيم الحاسوب\n"
    "☕ البرمجة الكائنية التوجه (Java)\n"
    "🌐 شبكات الحاسوب\n"
    "🎨 تصميم الويب 1\n"
    "🗣️ مهارات الاتصال\n"
    "🇾🇪 ثقافة وطنية\n\n"

    "━━━━━━━━━━━━━━━━━━\n"
    "🚀 UniX2"
)



    elif text == "📁 الملخصات":

        await update.message.reply_text(
              "━━━━━━━━━━━━━━━━━━\n"
        "📁 الملخصات\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "اختر المادة التي تريد ملخصاتها 👇\n\n"

        "🗄️ أساسيات قواعد البيانات\n"
        "💻 معمارية وتنظيم الحاسوب\n"
        "☕ البرمجة الكائنية التوجه (Java)\n"
        "🌐 شبكات الحاسوب\n"
        "🎨 تصميم الويب 1\n"
        "🗣️ مهارات الاتصال\n"
        "🇾🇪 ثقافة وطنية\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🔙 العودة"
    )                                      


    elif text == "📝 التكاليف":

        await update.message.reply_text(
              "━━━━━━━━━━━━━━━━━━\n"
        "📝 التكاليف والواجبات\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "للحصول على آخر التكاليف المطلوبة\n"
        "والتحديثات الخاصة بالمواد 👇\n\n"

        "💰 مسؤول التكاليف:\n"
        "⭐ عبدالله البرعي\n"
        "📞 +967730185760\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🔙 العودة"
    )


    elif text == "📄 الامتحانات السابقة":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "📄 الامتحانات السابقة\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "اختر المادة التي تريد امتحاناتها 👇\n\n"

        "🗄️ أساسيات قواعد البيانات\n"
        "💻 معمارية وتنظيم الحاسوب\n"
        "☕ البرمجة الكائنية التوجه (Java)\n"
        "🌐 شبكات الحاسوب\n"
        "🎨 تصميم الويب 1\n"
        "🗣️ مهارات الاتصال\n"
        "🇾🇪 ثقافة وطنية\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🔙 العودة"
    )
        
    elif text == "⏰ الدوام":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "⏰ حالة الدوام اليوم\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "❌ لا يوجد دوام اليوم\n\n"

        "📌 لا توجد محاضرات مسجلة حالياً.\n\n"

        "🔔 سيتم تحديث حالة الدوام\n"
        "عند إضافة أي محاضرة جديدة.\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "💡 نظامك الجامعي الذكي"
    )
        
    elif text == "📍 أماكن القاعات":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "📍 أماكن القاعات\n"
        "🏛️ كلية علوم وهندسة الحاسوب\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "🏛️ مبنى القديم\n\n"
        "⬆️ الدور الثاني\n"
        "🎓 المدرج 6\n\n"

        "━━━━━━━━━━━━━━━━━━\n\n"

        "🏢 مبنى الآداب\n\n"
        "📌 معافا الأهدل\n"
        "🎓 المدرجات الاثنين\n"
        "🎓 العلفي\n"
        "💻 معمل يمن موبايل\n"
        "💻 معمل الهندسة\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "📚 دليلك الجامعي الذكي"
    )
        
    elif text == "📢 الإعلانات":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "📢 الإعلانات الجامعية\n"
        "🎓 قسم تقنية المعلومات\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "🔔 آخر الأخبار والتحديثات:\n\n"

        "📌 لا توجد إعلانات جديدة حالياً.\n\n"

        "سيتم نشر:\n"
        "✅ مواعيد الاختبارات\n"
        "✅ تغييرات الدوام\n"
        "✅ التنبيهات المهمة\n"
        "✅ أخبار القسم\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "📚 ابقَ على اطلاع دائم"
    )



    elif text == "🧠 UniX2 AI":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "🧠 UniX2 AI\n"
        "🤖 المساعد الذكي\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "✨ أهلاً بك في عالم الذكاء الاصطناعي ✨\n\n"

        "أنا مساعدك الذكي المصمم لمساعدتك في:\n\n"
        "📚 شرح الدروس\n"
        "💻 مساعدة البرمجة\n"
        "🧠 تبسيط المفاهيم\n"
        "📝 حل الأسئلة\n"
        "🌍 الإجابة عن الأسئلة العامة خارج نظام الجامعة\n\n"

        "━━━━━━━━━━━━━━━━━━\n"

        "👨‍💻 مهندس النظام:\n"
        "⭐ عمر الشميري\n\n"

        "━━━━━━━━━━━━━━━━━━\n"

        "🚀 اضغط على زر بدء المحادثة\n"
        "للدخول إلى UniX2 AI"
    )
        

    elif text == "👤 المندوب":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━\n"
        "👤 مندوب الدفعة\n"
        "🎓 المستوى الثاني\n"
        "━━━━━━━━━━━━━━━━━━\n\n"

        "يسعدنا تعريفكم بمندوب الدفعة:\n\n"

        "⭐ الاسم:\n"
        "عبدالرزاق النجار\n\n"

        "💬 حساب التواصل:\n"
        '<a href="https://t.me/axyom_rzq">@axyom_rzq</a>\n\n'

        "📌 اضغط على الحساب للتواصل مباشرة.\n\n"

        "━━━━━━━━━━━━━━━━━━\n"
        "🚀 UniX2\n"
        "📚 نظامك الجامعي الذكي",

        parse_mode="HTML"
    )
        
    elif text == "💰 مسؤول التكاليف":

        await update.message.reply_text(
            "━━━━━━━━━━━━━━━━━━\n"
            "💰 مسؤول التكاليف\n"
            "🎓 المستوى الثاني\n"
            "━━━━━━━━━━━━━━━━━━\n\n"

            "للاستفسار عن آخر التكاليف\n"
            "والواجبات المطلوبة:\n\n"

            "⭐ الاسم:\n"
            "عبدالله البرعي\n\n"

            "📱 رقم التواصل:\n"
            "+967730185760\n\n"

            "━━━━━━━━━━━━━━━━━━\n"
            "🚀 UniX2\n"
            "📚 نظامك الجامعي الذكي"
    )




    elif text == "👨‍💻 مهندس النظام":

           await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━━━\n"
        "👨‍💻 مهندس النظام\n"
        "🚀 UniX2 Developer\n"
        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "✨ مطور وصانع نظام UniX2 الذكي ✨\n\n"

        "تم تصميم وتطوير هذا النظام\n"
        "لخدمة طلاب كلية علوم وهندسة الحاسوب\n"
        "وقسم تقنية المعلومات.\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "⭐ الاسم:\n"
        "عمر الشميري\n\n"

        "💻 التخصص:\n"
        "تقنية معلومات | IT\n\n"

        "🧠 مجالات التطوير:\n"
        "🐍 Python\n"
        "🤖 الذكاء الاصطناعي\n"
        "⚙️ تطوير الأنظمة والبوتات\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "💬 للتواصل مع مهندس النظام:\n"
        '<a href="https://t.me/alshmyrymr248">@alshmyrymr248</a>\n\n'

        "━━━━━━━━━━━━━━━━━━━━\n"

        "🚀 UniX2\n"
        "💡 فكرة... تطوير... مستقبل",

        parse_mode="HTML"
    )
           
    elif text == "ℹ️ عن النظام":

        await update.message.reply_text(
        "━━━━━━━━━━━━━━━━━━━━\n"
        "ℹ️ عن نظام UniX2\n"
        "🎓 Smart University Assistant\n"
        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "🚀 UniX2 هو نظام جامعي ذكي\n"
        "تم تطويره لخدمة طلاب كلية علوم وهندسة الحاسوب\n"
        "وقسم تقنية المعلومات.\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "🎯 أهداف النظام:\n"
        "✅ تسهيل الوصول إلى الخدمات الجامعية\n"
        "✅ تنظيم المواد والملخصات\n"
        "✅ متابعة التكاليف والواجبات\n"
        "✅ معرفة الدوام والقاعات\n"
        "✅ توفير المساعدة الذكية عبر UniX2 AI\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "⚙️ خدمات UniX2:\n"
        "📚 المواد الدراسية\n"
        "📁 الملخصات\n"
        "📝 التكاليف\n"
        "📄 الامتحانات السابقة\n"
        "⏰ حالة الدوام\n"
        "📢 الإعلانات الجامعية\n"
        "🤖 الذكاء الاصطناعي\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n\n"

        "👨‍💻 مهندس النظام:\n"
        "⭐ عمر الشميري\n\n"

        "🚀 الإصدار:\n"
        "Version 2.0\n\n"

        "━━━━━━━━━━━━━━━━━━━━\n"
        "💡 UniX2\n"
        "نظامك الجامعي الذكي"
    )




    else:

        await update.message.reply_text(
            "⚡ اختر أحد الخيارات من القائمة الرئيسية."
        )
